; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	infrared2 - mode
	image3 - mode
	image1 - mode
	spectrograph0 - mode
	Star1 - direction
	GroundStation3 - direction
	Star2 - direction
	Star4 - direction
	GroundStation0 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 image1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
	(supports instrument5 image3)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star2)
	(supports instrument6 image1)
	(calibration_target instrument6 Star4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet5)
)
(:goal (and
	(pointing satellite3 Phenomenon10)
	(pointing satellite4 Planet5)
	(have_image Planet5 image1)
	(have_image Planet6 image1)
	(have_image Planet7 image1)
	(have_image Star9 image3)
	(have_image Phenomenon10 image3)
	(have_image Star11 image1)
	(have_image Star12 image3)
	(have_image Star13 image3)
	(have_image Planet14 image1)
))

)

; plan
1. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 11
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 11
3. (turn_to satellite3 phenomenon10 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 11
4. (turn_to satellite3 star2 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star2)
   goals met: 1 of 11
5. (calibrate satellite3 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 1 of 11
6. (turn_to satellite3 phenomenon10 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 11
7. (take_image satellite3 phenomenon10 instrument5 image3)
   added: (have_image phenomenon10 image3)
   goals met: 3 of 11
8. (turn_to satellite0 groundstation0 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 11
9. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 3 of 11
10. (turn_to satellite0 planet14 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet14)
   goals met: 3 of 11
11. (take_image satellite0 planet14 instrument1 image1)
   added: (have_image planet14 image1)
   goals met: 4 of 11
12. (turn_to satellite0 planet5 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet5)
   goals met: 4 of 11
13. (take_image satellite0 planet5 instrument1 image1)
   added: (have_image planet5 image1)
   goals met: 5 of 11
14. (turn_to satellite0 planet6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet6)
   goals met: 5 of 11
15. (take_image satellite0 planet6 instrument1 image1)
   added: (have_image planet6 image1)
   goals met: 6 of 11
16. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 6 of 11
17. (take_image satellite0 planet7 instrument1 image1)
   added: (have_image planet7 image1)
   goals met: 7 of 11
18. (turn_to satellite0 star11 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star11)
   goals met: 7 of 11
19. (take_image satellite0 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 8 of 11
20. (turn_to satellite3 star12 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star12)
   goals met: 7 of 11
21. (take_image satellite3 star12 instrument5 image3)
   added: (have_image star12 image3)
   goals met: 8 of 11
22. (turn_to satellite3 phenomenon10 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 phenomenon10)
   goals met: 9 of 11
23. (turn_to satellite3 star13 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star13)
   goals met: 8 of 11
24. (take_image satellite3 star13 instrument5 image3)
   added: (have_image star13 image3)
   goals met: 9 of 11
25. (turn_to satellite3 phenomenon10 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 phenomenon10)
   goals met: 10 of 11
26. (turn_to satellite3 star9 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star9)
   goals met: 9 of 11
27. (take_image satellite3 star9 instrument5 image3)
   added: (have_image star9 image3)
   goals met: 10 of 11
28. (turn_to satellite3 phenomenon10 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 phenomenon10)
   goals met: 11 of 11
